---
kind: method
id: M:Autodesk.Revit.DB.Frame.IsOrthonormal
source: html/8ef3b2a0-119d-12c1-9e13-a3a878e76580.htm
---
# Autodesk.Revit.DB.Frame.IsOrthonormal Method

Determines if this frame's basis vectors are orthonormal.

## Syntax (C#)
```csharp
public bool IsOrthonormal()
```

## Returns
True if this frame's basis vectors are orthonormal, false if not.

## Remarks
"Orthonormal" means that the three vectors are orthogonal and each of them has unit length.